Revit 2026 API

# SplitButtonData Constructor

---

Constructs a new instance of SplitButtonData.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SplitButtonData(
	string name,
	string text
)
```
```vb
Public Sub New (
	name As String,
	text As String
)
```
```cpp
public:
SplitButtonData(
	String^ name,
	String^ text
)
```
```fsharp
new :
        name : string *
        text : string -> SplitButtonData
```

#### Parameters

name String
    The internal name of the new button.
text String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when  is passed for one or more arguments. |
| ArgumentException | Thrown when an empty string is passed for one or more arguments. |

This text will be displayed on the button if drop-down is empty. If sub-items are added, then the split button will display the current PushButton's text.

#### Reference

SplitButtonData Class

Autodesk.Revit.UI Namespace